---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.Vertex
source: html/0434973b-559d-a27f-25f9-f6bf6ef4f750.htm
---
# Autodesk.Revit.DB.DirectContext3D.Vertex

The base class for DirectContext3D vertices.

## Syntax (C#)
```csharp
public class Vertex : IDisposable
```